/* Text for close button */
"Close" = "Sulje";

/* Text for button to scan a credit card */
"Scan Card" = "Skannaa kortti";

/* Button title to open camera to scan credit/debit card */
"Scan card" = "Skannaa kortti";

/* An error message displayed when the customer's iban is invalid. */
"The IBAN you entered is invalid." = "Antamasi IBAN on virheellinen.";

/* Error when there is a problem processing the credit card */
"There was an error processing your card -- try again in a few seconds" = "Kortin käsittelyssä tapahtui virhe – kokeile uudelleen muutaman sekunnin kuluttua";

/* Unexpected error, such as a 500 from Stripe or a JSON parse error */
"There was an unexpected error -- try again in a few seconds" = "Odottamaton virhe – kokeile uudelleen muutaman sekunnin kuluttua";

/* Button to reload web view if we were unable to connect. */
"Try again" = "Yritä uudelleen";

/* Error when the card has already expired */
"Your card has expired" = "Korttisi on vanhentunut";

/* Error when the card was declined by the credit card networks */
"Your card was declined" = "Korttiasi ei hyväksytty";

/* Error when the card&apos;s expiration month is not valid */
"Your card's expiration month is invalid" = "Kortin erääntymiskuukausi ei kelpaa";

/* Error when the card&apos;s expiration year is not valid */
"Your card's expiration year is invalid" = "Kortin erääntymisvuosi ei kelpaa";

/* Error when the card number is not valid */
"Your card's number is invalid" = "Kortin numero ei kelpaa";

/* Error when the card&apos;s CVC is not valid */
"Your card's security code is invalid" = "Kortin turvakoodi ei kelpaa";

/* Error when customer's name is invalid */
"Your name is invalid." = "Nimi on virheellinen.";

